//TODO: № 1 на if...else ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const number = 10;
// if (number === 10) {
//   console.log("Вірно");
// } else {
//   console.log("Невірно");
// }

//TODO: № 2 на тернарник =============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно' через тернарник

// let num = 5;
// console.log(num === 10 ? "Вірно" : "Невірно");

//TODO: № 3 на if...else if ===============================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

// let min = 61;
// if (min >= 0 && min <= 15) {
//   console.log("перша чверть");
// } else if (min > 15 && min <= 30) {
//   console.log("друга чверть");
// } else if (min > 30 && min <= 45) {
//   console.log("третя чверть");
// } else if (min > 45 && min <= 59) {
//   console.log("четверта чверть");
// } else {
//   console.log("Некоректне значення");
// }
